MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX110F016C.atdf
      <value-group caption="Channel Transfer Abort IRQ bits" name="DCH0ECON__CHAIRQ">
         <value caption="Interrupt 255 will abort any transfers in progress and set CHAIF flag" name="" value="0xff" />
         <value caption="Interrupt 254 will abort any transfers in progress and set CHAIF flag" name="" value="0xfe" />
         <value caption="Interrupt 253 will abort any transfers in progress and set CHAIF flag" name="" value="0xfd" />
         <value caption="Interrupt 252 will abort any transfers in progress and set CHAIF flag" name="" value="0xfc" />
         <value caption="Interrupt 251 will abort any transfers in progress and set CHAIF flag" name="" value="0xfb" />
         <value caption="Interrupt 250 will abort any transfers in progress and set CHAIF flag" name="" value="0xfa" />
         <value caption="Interrupt 249 will abort any transfers in progress and set CHAIF flag" name="" value="0xf9" />
         <value caption="Interrupt 248 will abort any transfers in progress and set CHAIF flag" name="" value="0xf8" />
         <value caption="Interrupt 247 will abort any transfers in progress and set CHAIF flag" name="" value="0xf7" />
         <value caption="Interrupt 246 will abort any transfers in progress and set CHAIF flag" name="" value="0xf6" />
         <value caption="Interrupt 245 will abort any transfers in progress and set CHAIF flag" name="" value="0xf5" />
         <value caption="Interrupt 244 will abort any transfers in progress and set CHAIF flag" name="" value="0xf4" />
         <value caption="Interrupt 243 will abort any transfers in progress and set CHAIF flag" name="" value="0xf3" />
         <value caption="Interrupt 242 will abort any transfers in progress and set CHAIF flag" name="" value="0xf2" />
         <value caption="Interrupt 241 will abort any transfers in progress and set CHAIF flag" name="" value="0xf1" />
         <value caption="Interrupt 240 will abort any transfers in progress and set CHAIF flag" name="" value="0xf0" />
         <value caption="Interrupt 239 will abort any transfers in progress and set CHAIF flag" name="" value="0xef" />
         <value caption="Interrupt 238 will abort any transfers in progress and set CHAIF flag" name="" value="0xee" />
         <value caption="Interrupt 237 will abort any transfers in progress and set CHAIF flag" name="" value="0xed" />
         <value caption="Interrupt 236 will abort any transfers in progress and set CHAIF flag" name="" value="0xec" />
         <value caption="Interrupt 235 will abort any transfers in progress and set CHAIF flag" name="" value="0xeb" />
         <value caption="Interrupt 234 will abort any transfers in progress and set CHAIF flag" name="" value="0xea" />
         <value caption="Interrupt 233 will abort any transfers in progress and set CHAIF flag" name="" value="0xe9" />
         <value caption="Interrupt 232 will abort any transfers in progress and set CHAIF flag" name="" value="0xe8" />
         <value caption="Interrupt 231 will abort any transfers in progress and set CHAIF flag" name="" value="0xe7" />
         <value caption="Interrupt 230 will abort any transfers in progress and set CHAIF flag" name="" value="0xe6" />
         <value caption="Interrupt 229 will abort any transfers in progress and set CHAIF flag" name="" value="0xe5" />
         <value caption="Interrupt 228 will abort any transfers in progress and set CHAIF flag" name="" value="0xe4" />
         <value caption="Interrupt 227 will abort any transfers in progress and set CHAIF flag" name="" value="0xe3" />
         <value caption="Interrupt 226 will abort any transfers in progress and set CHAIF flag" name="" value="0xe2" />
         <value caption="Interrupt 225 will abort any transfers in progress and set CHAIF flag" name="" value="0xe1" />
         <value caption="Interrupt 224 will abort any transfers in progress and set CHAIF flag" name="" value="0xe0" />
         <value caption="Interrupt 223 will abort any transfers in progress and set CHAIF flag" name="" value="0xdf" />
         <value caption="Interrupt 222 will abort any transfers in progress and set CHAIF flag" name="" value="0xde" />
         <value caption="Interrupt 221 will abort any transfers in progress and set CHAIF flag" name="" value="0xdd" />
         <value caption="Interrupt 220 will abort any transfers in progress and set CHAIF flag" name="" value="0xdc" />
         <value caption="Interrupt 219 will abort any transfers in progress and set CHAIF flag" name="" value="0xdb" />
         <value caption="Interrupt 218 will abort any transfers in progress and set CHAIF flag" name="" value="0xda" />
         <value caption="Interrupt 217 will abort any transfers in progress and set CHAIF flag" name="" value="0xd9" />
         <value caption="Interrupt 216 will abort any transfers in progress and set CHAIF flag" name="" value="0xd8" />
         <value caption="Interrupt 215 will abort any transfers in progress and set CHAIF flag" name="" value="0xd7" />
         <value caption="Interrupt 214 will abort any transfers in progress and set CHAIF flag" name="" value="0xd6" />
         <value caption="Interrupt 213 will abort any transfers in progress and set CHAIF flag" name="" value="0xd5" />
         <value caption="Interrupt 212 will abort any transfers in progress and set CHAIF flag" name="" value="0xd4" />
         <value caption="Interrupt 211 will abort any transfers in progress and set CHAIF flag" name="" value="0xd3" />
         <value caption="Interrupt 210 will abort any transfers in progress and set CHAIF flag" name="" value="0xd2" />
         <value caption="Interrupt 209 will abort any transfers in progress and set CHAIF flag" name="" value="0xd1" />
         <value caption="Interrupt 208 will abort any transfers in progress and set CHAIF flag" name="" value="0xd0" />
         <value caption="Interrupt 207 will abort any transfers in progress and set CHAIF flag" name="" value="0xcf" />
         <value caption="Interrupt 206 will abort any transfers in progress and set CHAIF flag" name="" value="0xce" />
         <value caption="Interrupt 205 will abort any transfers in progress and set CHAIF flag" name="" value="0xcd" />
         <value caption="Interrupt 204 will abort any transfers in progress and set CHAIF flag" name="" value="0xcc" />
         <value caption="Interrupt 203 will abort any transfers in progress and set CHAIF flag" name="" value="0xcb" />
         <value caption="Interrupt 202 will abort any transfers in progress and set CHAIF flag" name="" value="0xca" />
         <value caption="Interrupt 201 will abort any transfers in progress and set CHAIF flag" name="" value="0xc9" />
         <value caption="Interrupt 200 will abort any transfers in progress and set CHAIF flag" name="" value="0xc8" />
         <value caption="Interrupt 199 will abort any transfers in progress and set CHAIF flag" name="" value="0xc7" />
         <value caption="Interrupt 198 will abort any transfers in progress and set CHAIF flag" name="" value="0xc6" />
         <value caption="Interrupt 197 will abort any transfers in progress and set CHAIF flag" name="" value="0xc5" />
         <value caption="Interrupt 196 will abort any transfers in progress and set CHAIF flag" name="" value="0xc4" />
         <value caption="Interrupt 195 will abort any transfers in progress and set CHAIF flag" name="" value="0xc3" />
         <value caption="Interrupt 194 will abort any transfers in progress and set CHAIF flag" name="" value="0xc2" />
         <value caption="Interrupt 193 will abort any transfers in progress and set CHAIF flag" name="" value="0xc1" />
         <value caption="Interrupt 192 will abort any transfers in progress and set CHAIF flag" name="" value="0xc0" />
         <value caption="Interrupt 191 will abort any transfers in progress and set CHAIF flag" name="" value="0xbf" />
         <value caption="Interrupt 190 will abort any transfers in progress and set CHAIF flag" name="" value="0xbe" />
         <value caption="Interrupt 189 will abort any transfers in progress and set CHAIF flag" name="" value="0xbd" />
         <value caption="Interrupt 188 will abort any transfers in progress and set CHAIF flag" name="" value="0xbc" />
         <value caption="Interrupt 187 will abort any transfers in progress and set CHAIF flag" name="" value="0xbb" />
         <value caption="Interrupt 186 will abort any transfers in progress and set CHAIF flag" name="" value="0xba" />
         <value caption="Interrupt 185 will abort any transfers in progress and set CHAIF flag" name="" value="0xb9" />
         <value caption="Interrupt 184 will abort any transfers in progress and set CHAIF flag" name="" value="0xb8" />
         <value caption="Interrupt 183 will abort any transfers in progress and set CHAIF flag" name="" value="0xb7" />
         <value caption="Interrupt 182 will abort any transfers in progress and set CHAIF flag" name="" value="0xb6" />
         <value caption="Interrupt 181 will abort any transfers in progress and set CHAIF flag" name="" value="0xb5" />
         <value caption="Interrupt 180 will abort any transfers in progress and set CHAIF flag" name="" value="0xb4" />
         <value caption="Interrupt 179 will abort any transfers in progress and set CHAIF flag" name="" value="0xb3" />
         <value caption="Interrupt 178 will abort any transfers in progress and set CHAIF flag" name="" value="0xb2" />
         <value caption="Interrupt 177 will abort any transfers in progress and set CHAIF flag" name="" value="0xb1" />
         <value caption="Interrupt 176 will abort any transfers in progress and set CHAIF flag" name="" value="0xb0" />
         <value caption="Interrupt 175 will abort any transfers in progress and set CHAIF flag" name="" value="0xaf" />
         <value caption="Interrupt 174 will abort any transfers in progress and set CHAIF flag" name="" value="0xae" />
         <value caption="Interrupt 173 will abort any transfers in progress and set CHAIF flag" name="" value="0xad" />
         <value caption="Interrupt 172 will abort any transfers in progress and set CHAIF flag" name="" value="0xac" />
         <value caption="Interrupt 171 will abort any transfers in progress and set CHAIF flag" name="" value="0xab" />
         <value caption="Interrupt 170 will abort any transfers in progress and set CHAIF flag" name="" value="0xaa" />
         <value caption="Interrupt 169 will abort any transfers in progress and set CHAIF flag" name="" value="0xa9" />
         <value caption="Interrupt 168 will abort any transfers in progress and set CHAIF flag" name="" value="0xa8" />
         <value caption="Interrupt 167 will abort any transfers in progress and set CHAIF flag" name="" value="0xa7" />
         <value caption="Interrupt 166 will abort any transfers in progress and set CHAIF flag" name="" value="0xa6" />
         <value caption="Interrupt 165 will abort any transfers in progress and set CHAIF flag" name="" value="0xa5" />
         <value caption="Interrupt 164 will abort any transfers in progress and set CHAIF flag" name="" value="0xa4" />
         <value caption="Interrupt 163 will abort any transfers in progress and set CHAIF flag" name="" value="0xa3" />
         <value caption="Interrupt 162 will abort any transfers in progress and set CHAIF flag" name="" value="0xa2" />
         <value caption="Interrupt 161 will abort any transfers in progress and set CHAIF flag" name="" value="0xa1" />
         <value caption="Interrupt 160 will abort any transfers in progress and set CHAIF flag" name="" value="0xa0" />
         <value caption="Interrupt 159 will abort any transfers in progress and set CHAIF flag" name="" value="0x9f" />
         <value caption="Interrupt 158 will abort any transfers in progress and set CHAIF flag" name="" value="0x9e" />
         <value caption="Interrupt 157 will abort any transfers in progress and set CHAIF flag" name="" value="0x9d" />
         <value caption="Interrupt 156 will abort any transfers in progress and set CHAIF flag" name="" value="0x9c" />
         <value caption="Interrupt 155 will abort any transfers in progress and set CHAIF flag" name="" value="0x9b" />
         <value caption="Interrupt 154 will abort any transfers in progress and set CHAIF flag" name="" value="0x9a" />
         <value caption="Interrupt 153 will abort any transfers in progress and set CHAIF flag" name="" value="0x99" />
         <value caption="Interrupt 152 will abort any transfers in progress and set CHAIF flag" name="" value="0x98" />
         <value caption="Interrupt 151 will abort any transfers in progress and set CHAIF flag" name="" value="0x97" />
         <value caption="Interrupt 150 will abort any transfers in progress and set CHAIF flag" name="" value="0x96" />
         <value caption="Interrupt 149 will abort any transfers in progress and set CHAIF flag" name="" value="0x95" />
         <value caption="Interrupt 148 will abort any transfers in progress and set CHAIF flag" name="" value="0x94" />
         <value caption="Interrupt 147 will abort any transfers in progress and set CHAIF flag" name="" value="0x93" />
         <value caption="Interrupt 146 will abort any transfers in progress and set CHAIF flag" name="" value="0x92" />
         <value caption="Interrupt 145 will abort any transfers in progress and set CHAIF flag" name="" value="0x91" />
         <value caption="Interrupt 144 will abort any transfers in progress and set CHAIF flag" name="" value="0x90" />
         <value caption="Interrupt 143 will abort any transfers in progress and set CHAIF flag" name="" value="0x8f" />
         <value caption="Interrupt 142 will abort any transfers in progress and set CHAIF flag" name="" value="0x8e" />
         <value caption="Interrupt 141 will abort any transfers in progress and set CHAIF flag" name="" value="0x8d" />
         <value caption="Interrupt 140 will abort any transfers in progress and set CHAIF flag" name="" value="0x8c" />
         <value caption="Interrupt 139 will abort any transfers in progress and set CHAIF flag" name="" value="0x8b" />
         <value caption="Interrupt 138 will abort any transfers in progress and set CHAIF flag" name="" value="0x8a" />
         <value caption="Interrupt 137 will abort any transfers in progress and set CHAIF flag" name="" value="0x89" />
         <value caption="Interrupt 136 will abort any transfers in progress and set CHAIF flag" name="" value="0x88" />
         <value caption="Interrupt 135 will abort any transfers in progress and set CHAIF flag" name="" value="0x87" />
         <value caption="Interrupt 134 will abort any transfers in progress and set CHAIF flag" name="" value="0x86" />
         <value caption="Interrupt 133 will abort any transfers in progress and set CHAIF flag" name="" value="0x85" />
         <value caption="Interrupt 132 will abort any transfers in progress and set CHAIF flag" name="" value="0x84" />
         <value caption="Interrupt 131 will abort any transfers in progress and set CHAIF flag" name="" value="0x83" />
         <value caption="Interrupt 130 will abort any transfers in progress and set CHAIF flag" name="" value="0x82" />
         <value caption="Interrupt 129 will abort any transfers in progress and set CHAIF flag" name="" value="0x81" />
         <value caption="Interrupt 128 will abort any transfers in progress and set CHAIF flag" name="" value="0x80" />
         <value caption="Interrupt 127 will abort any transfers in progress and set CHAIF flag" name="" value="0x7f" />
         <value caption="Interrupt 126 will abort any transfers in progress and set CHAIF flag" name="" value="0x7e" />
         <value caption="Interrupt 125 will abort any transfers in progress and set CHAIF flag" name="" value="0x7d" />
         <value caption="Interrupt 124 will abort any transfers in progress and set CHAIF flag" name="" value="0x7c" />
         <value caption="Interrupt 123 will abort any transfers in progress and set CHAIF flag" name="" value="0x7b" />
         <value caption="Interrupt 122 will abort any transfers in progress and set CHAIF flag" name="" value="0x7a" />
         <value caption="Interrupt 121 will abort any transfers in progress and set CHAIF flag" name="" value="0x79" />
         <value caption="Interrupt 120 will abort any transfers in progress and set CHAIF flag" name="" value="0x78" />
         <value caption="Interrupt 119 will abort any transfers in progress and set CHAIF flag" name="" value="0x77" />
         <value caption="Interrupt 118 will abort any transfers in progress and set CHAIF flag" name="" value="0x76" />
         <value caption="Interrupt 117 will abort any transfers in progress and set CHAIF flag" name="" value="0x75" />
         <value caption="Interrupt 116 will abort any transfers in progress and set CHAIF flag" name="" value="0x74" />
         <value caption="Interrupt 115 will abort any transfers in progress and set CHAIF flag" name="" value="0x73" />
         <value caption="Interrupt 114 will abort any transfers in progress and set CHAIF flag" name="" value="0x72" />
         <value caption="Interrupt 113 will abort any transfers in progress and set CHAIF flag" name="" value="0x71" />
         <value caption="Interrupt 112 will abort any transfers in progress and set CHAIF flag" name="" value="0x70" />
         <value caption="Interrupt 111 will abort any transfers in progress and set CHAIF flag" name="" value="0x6f" />
         <value caption="Interrupt 110 will abort any transfers in progress and set CHAIF flag" name="" value="0x6e" />
         <value caption="Interrupt 109 will abort any transfers in progress and set CHAIF flag" name="" value="0x6d" />
         <value caption="Interrupt 108 will abort any transfers in progress and set CHAIF flag" name="" value="0x6c" />
         <value caption="Interrupt 107 will abort any transfers in progress and set CHAIF flag" name="" value="0x6b" />
         <value caption="Interrupt 106 will abort any transfers in progress and set CHAIF flag" name="" value="0x6a" />
         <value caption="Interrupt 105 will abort any transfers in progress and set CHAIF flag" name="" value="0x69" />
         <value caption="Interrupt 104 will abort any transfers in progress and set CHAIF flag" name="" value="0x68" />
         <value caption="Interrupt 103 will abort any transfers in progress and set CHAIF flag" name="" value="0x67" />
         <value caption="Interrupt 102 will abort any transfers in progress and set CHAIF flag" name="" value="0x66" />
         <value caption="Interrupt 101 will abort any transfers in progress and set CHAIF flag" name="" value="0x65" />
         <value caption="Interrupt 100 will abort any transfers in progress and set CHAIF flag" name="" value="0x64" />
         <value caption="Interrupt 99 will abort any transfers in progress and set CHAIF flag" name="" value="0x63" />
         <value caption="Interrupt 98 will abort any transfers in progress and set CHAIF flag" name="" value="0x62" />
         <value caption="Interrupt 97 will abort any transfers in progress and set CHAIF flag" name="" value="0x61" />
         <value caption="Interrupt 96 will abort any transfers in progress and set CHAIF flag" name="" value="0x60" />
         <value caption="Interrupt 95 will abort any transfers in progress and set CHAIF flag" name="" value="0x5f" />
         <value caption="Interrupt 94 will abort any transfers in progress and set CHAIF flag" name="" value="0x5e" />
         <value caption="Interrupt 93 will abort any transfers in progress and set CHAIF flag" name="" value="0x5d" />
         <value caption="Interrupt 92 will abort any transfers in progress and set CHAIF flag" name="" value="0x5c" />
         <value caption="Interrupt 91 will abort any transfers in progress and set CHAIF flag" name="" value="0x5b" />
         <value caption="Interrupt 90 will abort any transfers in progress and set CHAIF flag" name="" value="0x5a" />
         <value caption="Interrupt 89 will abort any transfers in progress and set CHAIF flag" name="" value="0x59" />
         <value caption="Interrupt 88 will abort any transfers in progress and set CHAIF flag" name="" value="0x58" />
         <value caption="Interrupt 87 will abort any transfers in progress and set CHAIF flag" name="" value="0x57" />
         <value caption="Interrupt 86 will abort any transfers in progress and set CHAIF flag" name="" value="0x56" />
         <value caption="Interrupt 85 will abort any transfers in progress and set CHAIF flag" name="" value="0x55" />
         <value caption="Interrupt 84 will abort any transfers in progress and set CHAIF flag" name="" value="0x54" />
         <value caption="Interrupt 83 will abort any transfers in progress and set CHAIF flag" name="" value="0x53" />
         <value caption="Interrupt 82 will abort any transfers in progress and set CHAIF flag" name="" value="0x52" />
         <value caption="Interrupt 81 will abort any transfers in progress and set CHAIF flag" name="" value="0x51" />
         <value caption="Interrupt 80 will abort any transfers in progress and set CHAIF flag" name="" value="0x50" />
         <value caption="Interrupt 79 will abort any transfers in progress and set CHAIF flag" name="" value="0x4f" />
         <value caption="Interrupt 78 will abort any transfers in progress and set CHAIF flag" name="" value="0x4e" />
         <value caption="Interrupt 77 will abort any transfers in progress and set CHAIF flag" name="" value="0x4d" />
         <value caption="Interrupt 76 will abort any transfers in progress and set CHAIF flag" name="" value="0x4c" />
         <value caption="Interrupt 75 will abort any transfers in progress and set CHAIF flag" name="" value="0x4b" />
         <value caption="Interrupt 74 will abort any transfers in progress and set CHAIF flag" name="" value="0x4a" />
         <value caption="Interrupt 73 will abort any transfers in progress and set CHAIF flag" name="" value="0x49" />
         <value caption="Interrupt 72 will abort any transfers in progress and set CHAIF flag" name="" value="0x48" />
         <value caption="Interrupt 71 will abort any transfers in progress and set CHAIF flag" name="" value="0x47" />
         <value caption="Interrupt 70 will abort any transfers in progress and set CHAIF flag" name="" value="0x46" />
         <value caption="Interrupt 69 will abort any transfers in progress and set CHAIF flag" name="" value="0x45" />
         <value caption="Interrupt 68 will abort any transfers in progress and set CHAIF flag" name="" value="0x44" />
         <value caption="Interrupt 67 will abort any transfers in progress and set CHAIF flag" name="" value="0x43" />
         <value caption="Interrupt 66 will abort any transfers in progress and set CHAIF flag" name="" value="0x42" />
         <value caption="Interrupt 65 will abort any transfers in progress and set CHAIF flag" name="" value="0x41" />
         <value caption="Interrupt 64 will abort any transfers in progress and set CHAIF flag" name="" value="0x40" />
         <value caption="Interrupt 63 will abort any transfers in progress and set CHAIF flag" name="" value="0x3f" />
         <value caption="Interrupt 62 will abort any transfers in progress and set CHAIF flag" name="" value="0x3e" />
         <value caption="Interrupt 61 will abort any transfers in progress and set CHAIF flag" name="" value="0x3d" />
         <value caption="Interrupt 60 will abort any transfers in progress and set CHAIF flag" name="" value="0x3c" />
         <value caption="Interrupt 59 will abort any transfers in progress and set CHAIF flag" name="" value="0x3b" />
         <value caption="Interrupt 58 will abort any transfers in progress and set CHAIF flag" name="" value="0x3a" />
         <value caption="Interrupt 57 will abort any transfers in progress and set CHAIF flag" name="" value="0x39" />
